# -*- coding: utf-8 -*-
# Copyright (c) Huawei Technologies Co., Ltd. 2023-2025. All rights reserved.


class Pattern:
    """constants of pattern"""

    CN_CHAR = "[一-龥]"

    LIMIT_Y_STR = r"(前(一)?|今|明|去|同|当|后|大前|本|次|上(一)?|这(一)?)年"
    LUNAR_Y_STR = (
        r"([一二三四五六七八九零〇]{2}|[一二三四五六七八九零〇]{4}|[12]\d{3}|\d{2})年"
    )

    # 年
    LIMIT_YEAR_STRING = r"(前(一)?|今|明|去|同|当|后|大前|本|次|上(一)?|这(一)?)年"
    LUNAR_YEAR_STRING = (
        r"([一二三四五六七八九零〇]{2}|[一二三四五六七八九零〇]{4}|[12]\d{3}|\d{2})年"
    )
    YEAR_STRING = r"([12]?\d{2,3}|[一二三四五六七八九零〇]{2,4})年"

    M_NUM_STR = r"(1[012]|[0]?[1-9]|十[一二]|[一二三四五六七八九十])"
    M_STR = M_NUM_STR + r"月(份)?"
    M_NUM_STR = M_NUM_STR[:-2] + r"两])"
    LUNAR_M_STR = r"(闰)?([正一二三四五六七八九十冬腊]|十[一二]|[1-9]|1[012])月"
    LIMIT_M_STR = r"([下上]((一)?个)?|同|本|当|次|这)月"
    SELF_EVI_LUNAR_M_STR = (
        r"((闰)?[正冬腊]|闰([一二三四五六七八九十]|十[一二]|[1-9]|1[012]))月"
    )

    # 月
    MONTH_NUM_STRING = (
        r"(1[012]|[0]?[1-9]|十[一二]|[一二三四五六七八九十])"  # 1~12 std month num
    )
    MONTH_STRING = MONTH_NUM_STRING + r"月(份)?"
    MONTH_NUM_STRING = MONTH_NUM_STRING[:-2] + r"两])"  # 1~12 order month num
    BLUR_MONTH_STRING = (
        r"年?(初|[一]开年|伊始|末|尾|终|底|[上下]半年|[暑寒][假期]|[前中后]期)"
    )
    LUNAR_MONTH_STRING = r"(闰)?([正一二三四五六七八九十冬腊]|十[一二]|[1-9]|1[012])月"
    LIMIT_MONTH_STRING = r"((下(下)?|上(上)?)((一)?个)?|同|本|当|次|(这((一)?个)?))月"
    SELF_EVI_LUNAR_MONTH_STRING = (
        r"((闰)?[正冬腊]|闰([一二三四五六七八九十]|十[一二]|[1-9]|1[012]))月"
    )

    # 周
    W_NUM_STR = r"[一二两三四五六七八九十0-9]{1,3}"
    W_STR = r"(周|星期|礼拜)"
    WEEK_NUM_STRING = r"周?[一二两三四五六七八九十0-9]{1,3}"  # 1~52
    WEEK_STRING = r"(周|星期|礼拜)"

    # 日
    D_NUM_STR = r"(([12]\d|3[01]|[0]?[1-9])|([一二]?十)?[一二三四五六七八九]|(三十)?[一]|[二三]?十)"
    D_STR = D_NUM_STR + r"[日号]"
    DAY_NUM_STRING = r"(([12]\d|3[01]|[0]?[1-9])|([一二]?十)?[一二三四五六七八九]|(三十)?[一]|[二三]?十)"  # 1~31
    DAY_STRING = DAY_NUM_STRING + r"[日号]"
    BLUR_DAY_STRING = r"月?([上中下]旬|初|中|底|末)"

    LUNAR_SOLAR_D_STR = r"((初|(二)?十|廿)[一二三四五六七八九]|[初二三]十|初([1-9]|10)|[12]\d|3[01]|[0]?[1-9])"
    LUNAR_D_STR = r"((初|(二)?十|廿)[一二三四五六七八九]|[初二三]十|初([1-9]|10))"
    SELF_EVI_LUNAR_D_STR = r"([初廿]([一二三四五六七八九十1-9]|10))"

    # 时
    H_STR = r"((十)?[一两二三四五六七八九]|[零〇十]|二十[一二三四]?|[01]?\d|2[01234])[时点](整|钟)?"
    BLUR_H_STR = r"(凌晨|白天|清[晨|早]|黎明|一(大)?早|早[晨上]?|[上中下]午|午后|(傍)?晚[间上]?|[深半午]?夜[里间]?|[上下前后]半夜)"

    # 分、秒
    MIN_SEC_STR = (
        r"((零|〇|[一二三四五]?十)[一二三四五六七八九]|[二三四五]?十|[012345]?\d)"
    )

    VERTICAL_LINE = "|"
    LU = r"([农阴]历)"
    LU_A = "".join([LU, r"?"])

    # 节气
    SOLAR_TERM_STR = (
        r"(立春|雨水|惊蛰|春分|清明|谷雨|立夏|小满|芒种|夏至|小暑|大暑|立秋|处暑|白露|秋分|寒露|霜降|立冬|小雪|大雪|冬至|"
        r"小寒|大寒)"
    )

    FIXED_SOLAR_FESTIVAL = (
        r"((元旦|十一(?![点时分秒]))|(三八|五一|六一|七一|八一|国庆|圣诞)(节)?|((三八)?妇女|女神|植树|(五一)?"
        r"劳动|(五四)?青年|(六一)?儿童|(七一)?建党|(八一)?建军|教师|情人|愚人|万圣|护士)节|地球日|三[\.•·・]?"
        r"一五|双(十一|11)|(.{1,4})?消费者权益日)"
    )
    FIXED_LUNAR_FESTIVAL = (
        r"((春|填仓|上巳|寒食|浴佛|姑姑|财神|下元|寒衣)节|(龙抬头|除夕)|(大年初[一二三四五六七八九十])|(端午|端阳|"
        r"七夕|元宵|中秋|重阳|腊八|中元)(节)?)"
    )
    REG_FOREIGN_FESTIVAL = r"(感恩|母亲|父亲)节"
    SINGLE_NUM_STR = r"[一两二三四五六七八九十\d]"

    # ---------------------------------------------------------------------
    # 中文字符正则
    ANCIENT_CHINESE_CHAR_PATTERN = (
        "[一-龥㐀-䶵]"  # 在 gb13000.1 基础上扩展 6582 个古汉字，共 27484 个汉字
    )
    # gb13000.1 收录的汉字 20902 个，但其中有很多不常用字，在 chinese_char_dictionary_loader 有说明
    CHINESE_CHAR_PATTERN = "[一-龥]"

    # 允许 `初8` 阿拉伯数字出现，但不允许 `廿2`、`23` 等作为农历`日`
    LUNAR_SOLAR_DAY_STRING = r"((初|(二)?十|廿)[一二三四五六七八九]|[初二三]十|初([1-9]|10)|[12]\d|3[01]|[0]?[1-9])"
    LUNAR_DAY_STRING = r"((初|(二)?十|廿)[一二三四五六七八九]|[初二三]十|初([1-9]|10))"
    SELF_EVI_LUNAR_DAY_STRING = r"([初廿]([一二三四五六七八九十1-9]|10))"

    QUARTER_NUM_STRING = r"(?:一|二|两|三|四|[1-4])"
    SINGLE_NUM_STRING = r"(?:[零一二两三四五六七八九十]|[\d])"
    DELTA_NUM_STRING = r"(([零一二两三四五六七八九十百千万]+点)?[零一两二三四五六七八九十百千万]+|([\d十百千万,]+)?[\d十百千万,]+(?:\.\d+)?)"
    DAY_DELTA_STRING = "".join(
        [
            DELTA_NUM_STRING,
            r"[多余]?[天日]",
            VERTICAL_LINE,
            "半天",
            VERTICAL_LINE,
            SINGLE_NUM_STRING,
            "天半",
        ]
    )

    # 将时间进行转换
    DELTA_SUB = r"([之以]?[内前后来])"
